book/slides/04_dplyr_slides.org
#+STARTUP: beamer
#+TITLE:     Research Cycle 04: dplyr one-table verbs
#+AUTHOR:    Dale J. Barr
#+EMAIL:     dale.barr@glasgow.ac.uk
#+DATE:      University of Glasgow
#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  en
#+OPTIONS:   H:2 num:nil toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t ^:nil
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:(not LOGBOOK) todo:t pri:nil tags:t
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation]
#+LATEX_HEADER: \usepackage{helvet}
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \definecolor{lgray}{rgb}{0.90,0.90,0.90}
#+BEAMER_THEME: Boadilla
#+BEAMER_COLOR_THEME: seahorse
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_act(Act) %4BEAMER_col(Col) %8BEAMER_opt(Opt)
#+PROPERTY: BEAMER_col_ALL 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 0.0 :ETC
#+PROPERTY: header-args:R :session *R* :tangle lec01/stub_script.R :exports code

* Setup																														 :noexport:

#+name: setup-minted
#+begin_src emacs-lisp :exports none :results silent
(setq org-src-preserve-indentation t)
(setq org-latex-minted-options
			'(("frame" "none")
				("fontsize" "\\scriptsize")
				("linenos" "false")
				("bgcolor" "lgray")
				("tabsize" "2")
				))
#+end_src


* Main

** Tidy data

#+LaTeX: \framesubtitle{Wickham (2014)}
#+LaTeX: \begin{Large}

#+BEGIN_QUOTE
"Happy families are all alike; every unhappy family is unhappy in its own way."
#+END_QUOTE

#+LaTeX: \end{Large}
#+LaTeX: \begin{flushright}-Tolstoy\end{flushright}

- Tidy datasets conform to a standardized way of linking
  *data\nbsp{}structure* to *data semantics* (meaning)

** Tidy data

#+LaTeX: \framesubtitle{(see also Codd, 1990; ``3rd normal form'')}

A dataset is a collection of \structure{values} observed on
\structure{variables} across different \structure{observation units}.

*** Tidy Data																		 :B_definition:
		:PROPERTIES:
		:BEAMER_env: definition
		:END:

1. Each variable forms a column.
2. Each observation forms a row.
3. Each type of observational unit forms a table.

*** back 																										:B_ignoreheading:
		:PROPERTIES:
		:BEAMER_env: ignoreheading
		:END:

#+LaTeX: \begin{scriptsize}

|-----------+--------+------+-----+--------|
| SubjectID | ItemID | Cond |  RT | Choice |
|-----------+--------+------+-----+--------|
|         1 |      1 | E    | 637 | A      |
|         1 |      2 | C    | 998 | B      |
|         1 |      3 | E    | 773 | B      |
|         1 |      4 | C    | 890 | B      |
|         2 |      1 | C    | 590 | A      |
|         2 |      2 | E    | 911 | B      |
|         2 |      3 | C    | 708 | B      |
|         2 |      4 | E    | 621 | A      |
|-----------+--------+------+-----+--------|

#+LaTeX: \end{scriptsize}

** One of infinitely many messy versions

#+LaTeX: \begin{tiny}
|-----------+-------+-------+-------+-------+-----+-----+-----+-----+-----+-----+-----+-----|
| SubjectID | Cond1 | Cond2 | Cond3 | Cond4 | RT1 | RT2 | RT3 | RT4 | Ch1 | Ch2 | Ch3 | Ch4 |
|-----------+-------+-------+-------+-------+-----+-----+-----+-----+-----+-----+-----+-----|
|         1 | E     | C     | E     | C     | 637 | 998 | 773 | 890 | A   | B   | B   | B   |
|         2 | C     | E     | C     | E     | 590 | 911 | 708 | 621 | A   | B   | B   | A   |
|-----------+-------+-------+-------+-------+-----+-----+-----+-----+-----+-----+-----+-----|
#+LaTeX: \end{tiny}

- wide format
- one column for each item for each variable, no easy mapping from
  structure to semantics
- column names different for same variable (e.g., RT1..RT4)
- different strategies for different obs units (e.g., calc subject means at each level of Cond)
  - must be done by hand, and thus, *error prone*


** Tidy-ish representation of multilevel data

#+LaTeX: \begin{tiny}
|-----------+--------+--------+--------+------+---------+------+-----+--------|
| SubjectID | ListID | Gender | ItemID | Freq | TrialID | Cond |  RT | Choice |
|-----------+--------+--------+--------+------+---------+------+-----+--------|
|         1 | X      | F      |      1 | L    |       1 | E    | 637 | A      |
|         1 | X      | F      |      2 | H    |       2 | C    | 998 | B      |
|         1 | X      | F      |      3 | L    |       3 | E    | 773 | B      |
|         1 | X      | F      |      4 | H    |       4 | C    | 890 | B      |
|         2 | Y      | M      |      1 | L    |       5 | C    | 590 | A      |
|         2 | Y      | M      |      2 | H    |       6 | E    | 911 | B      |
|         2 | Y      | M      |      3 | L    |       7 | C    | 708 | B      |
|         2 | Y      | M      |      4 | H    |       8 | E    | 621 | A      |
|-----------+--------+--------+--------+------+---------+------+-----+--------|
#+LaTeX: \end{tiny}

- it obeys principles 1 & 2 (obs=rows, vars=cols), but violates 3
- PROBLEM: redundant information in the table, difficult to change
  values for certain variables, or add new variables at the subject
  level, *error prone*

** Tidy representation of multilevel data

*** Subject																										:B_block:BMCOL:
		:PROPERTIES:
		:BEAMER_env: block
		:BEAMER_col: .5
		:END:

#+LaTeX: \begin{scriptsize}

| SubjectID | ListID | Gender |
|-----------+--------+--------|
|         1 | X      | F      |
|         2 | Y      | M      |

#+LaTeX: \end{scriptsize}

*** Cols																													:B_columns:
		:PROPERTIES:
		:BEAMER_env: columns
		:END:

**** Item 																										:B_block:BMCOL:
		:PROPERTIES:
		:BEAMER_col: .2
		:BEAMER_env: block
		:END:

#+LaTeX: \begin{scriptsize}

| ItemID | Freq |
|--------+------|
|      1 | H    |
|      2 | L    |
|      3 | H    |
|      4 | L    |

#+LaTeX: \end{scriptsize}

**** Trial 																										:B_block:BMCOL:
		:PROPERTIES:
		:BEAMER_col: .7
		:BEAMER_env: block
		:END:

#+LaTeX: \begin{scriptsize}

| SubjectID | ItemID | TrialID | Cond |  RT | Choice |
|-----------+--------+---------+------+-----+--------|
|         1 |      1 |       1 | E    | 637 | A      |
|         1 |      2 |       2 | C    | 998 | B      |
|         1 |      3 |       3 | E    | 773 | B      |
|         1 |      4 |       4 | C    | 890 | B      |
|         2 |      1 |       5 | C    | 590 | A      |
|         2 |      2 |       6 | E    | 911 | B      |
|         2 |      3 |       7 | C    | 708 | B      |
|         2 |      4 |       8 | E    | 621 | A      |

#+LaTeX: \end{scriptsize}



** Tidy tools

#+LaTeX: \framesubtitle{Wickham (submitted)}

*** Tidy tools																								:B_block:BMCOL:
		:PROPERTIES:
		:BEAMER_env: block
		:BEAMER_col: .5
		:END:

| tidy data | \(\rightarrow\) | tidy data |
| /input/   |                 | /output/  |

*** back																										:B_ignoreheading:
		:PROPERTIES:
		:BEAMER_env: ignoreheading
		:END:

#+BEGIN_EXPORT latex
\begin{description}[transforming]
  \item[transform] create/modify variables, rearranging columns
  \item[filter] include/exclude observations (rows)
  \item[aggregate] collapse subsets of observations into single values
  \item[order] sort observations
\end{description}
#+END_EXPORT

Not all tools in base =R= are tidy. Wickham's package =dplyr= adds tidy
versions, plus additional functionality. Also, optimized for speed!

** =dplyr= and the Wickham Six

According to R developer Hadley Wickham (@hadleywickham), 90% of data
analysis can be reduced to the operations described by six English
verbs.

| =select()=    | Include or exclude certain variables (columns)        |
| =filter()=    | Include or exclude certain observations (rows)        |
| =mutate()=    | Create new variables (columns)                        |
| =arrange()=   | Change the order of observations (rows)               |
| =group_by()=  | Organize the observations into groups                 |
| =summarise()= | Derive aggregate variables for groups of observations |

These functions reside in the add-on package =dplyr=.  See the data
wrangling cheat sheet!

** Boolean expressions

#+LaTeX: \begin{small}

| Operator | Name                  | is TRUE if and only if          |
|----------+-----------------------+---------------------------------|
| A < B    | less than             | A is less than B                |
| A <= B   | less than or equal    | A is less than or equal to B    |
| A > B    | greater than          | A is greater than B             |
| A >= B   | greater than or equal | A is greater than or equal to B |
| A == B   | equivalence           | A exactly equals B              |
| A != B   | not equal             | A does not exactly equal B      |
| A %in% B | in                    | A is an element of vector B     |

#+LaTeX: \end{small}
