slides/04_dplyr_slides.tex
% Created 2017-10-13 Fri 09:04
% Intended LaTeX compiler: pdflatex
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{helvet}
\usepackage{xcolor}
\definecolor{lgray}{rgb}{0.90,0.90,0.90}
\usetheme{Boadilla}
\usecolortheme{seahorse}
\author{Dale J. Barr}
\date{University of Glasgow}
\title{Research Cycle 04: dplyr one-table verbs}
\hypersetup{
 pdfauthor={Dale J. Barr},
 pdftitle={Research Cycle 04: dplyr one-table verbs},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.4)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{Main}
\label{sec:orgb59e705}

\begin{frame}[label={sec:org9f5ac3d}]{Tidy data}
\framesubtitle{Wickham (2014)}
\begin{Large}

\begin{quote}
``Happy families are all alike; every unhappy family is unhappy in its own way.''
\end{quote}

\end{Large}
\begin{flushright}-Tolstoy\end{flushright}

\begin{itemize}
\item Tidy datasets conform to a standardized way of linking
\alert{data~structure} to \alert{data semantics} (meaning)
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org92ee0de}]{Tidy data}
\framesubtitle{(see also Codd, 1990; ``3rd normal form'')}

A dataset is a collection of \structure{values} observed on
\structure{variables} across different \structure{observation units}.

\begin{definition}[Tidy Data]
\begin{enumerate}
\item Each variable forms a column.
\item Each observation forms a row.
\item Each type of observational unit forms a table.
\end{enumerate}
\end{definition}

\begin{scriptsize}

\begin{center}
\begin{tabular}{rrlrl}
\hline
SubjectID & ItemID & Cond & RT & Choice\\
\hline
1 & 1 & E & 637 & A\\
1 & 2 & C & 998 & B\\
1 & 3 & E & 773 & B\\
1 & 4 & C & 890 & B\\
2 & 1 & C & 590 & A\\
2 & 2 & E & 911 & B\\
2 & 3 & C & 708 & B\\
2 & 4 & E & 621 & A\\
\hline
\end{tabular}
\end{center}

\end{scriptsize}
\end{frame}

\begin{frame}[label={sec:org4790edd}]{One of infinitely many messy versions}
\begin{tiny}
\begin{center}
\begin{tabular}{rllllrrrrllll}
\hline
SubjectID & Cond1 & Cond2 & Cond3 & Cond4 & RT1 & RT2 & RT3 & RT4 & Ch1 & Ch2 & Ch3 & Ch4\\
\hline
1 & E & C & E & C & 637 & 998 & 773 & 890 & A & B & B & B\\
2 & C & E & C & E & 590 & 911 & 708 & 621 & A & B & B & A\\
\hline
\end{tabular}
\end{center}
\end{tiny}

\begin{itemize}
\item wide format
\item one column for each item for each variable, no easy mapping from
structure to semantics
\item column names different for same variable (e.g., RT1..RT4)
\item different strategies for different obs units (e.g., calc subject means at each level of Cond)
\begin{itemize}
\item must be done by hand, and thus, \alert{error prone}
\end{itemize}
\end{itemize}
\end{frame}


\begin{frame}[label={sec:orga617e56}]{Tidy-ish representation of multilevel data}
\begin{tiny}
\begin{center}
\begin{tabular}{rllrlrlrl}
\hline
SubjectID & ListID & Gender & ItemID & Freq & TrialID & Cond & RT & Choice\\
\hline
1 & X & F & 1 & L & 1 & E & 637 & A\\
1 & X & F & 2 & H & 2 & C & 998 & B\\
1 & X & F & 3 & L & 3 & E & 773 & B\\
1 & X & F & 4 & H & 4 & C & 890 & B\\
2 & Y & M & 1 & L & 5 & C & 590 & A\\
2 & Y & M & 2 & H & 6 & E & 911 & B\\
2 & Y & M & 3 & L & 7 & C & 708 & B\\
2 & Y & M & 4 & H & 8 & E & 621 & A\\
\hline
\end{tabular}
\end{center}
\end{tiny}

\begin{itemize}
\item it obeys principles 1 \& 2 (obs=rows, vars=cols), but violates 3
\item PROBLEM: redundant information in the table, difficult to change
values for certain variables, or add new variables at the subject
level, \alert{error prone}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgdf48c7e}]{Tidy representation of multilevel data}
\begin{columns}
\begin{column}{.5\columnwidth}
\begin{block}{Subject}
\begin{scriptsize}

\begin{center}
\begin{tabular}{rll}
SubjectID & ListID & Gender\\
\hline
1 & X & F\\
2 & Y & M\\
\end{tabular}
\end{center}

\end{scriptsize}
\end{block}
\end{column}
\end{columns}

\begin{columns}
\begin{column}{.2\columnwidth}
\begin{block}{Item}
\begin{scriptsize}

\begin{center}
\begin{tabular}{rl}
ItemID & Freq\\
\hline
1 & H\\
2 & L\\
3 & H\\
4 & L\\
\end{tabular}
\end{center}

\end{scriptsize}
\end{block}
\end{column}

\begin{column}{.7\columnwidth}
\begin{block}{Trial}
\begin{scriptsize}

\begin{center}
\begin{tabular}{rrrlrl}
SubjectID & ItemID & TrialID & Cond & RT & Choice\\
\hline
1 & 1 & 1 & E & 637 & A\\
1 & 2 & 2 & C & 998 & B\\
1 & 3 & 3 & E & 773 & B\\
1 & 4 & 4 & C & 890 & B\\
2 & 1 & 5 & C & 590 & A\\
2 & 2 & 6 & E & 911 & B\\
2 & 3 & 7 & C & 708 & B\\
2 & 4 & 8 & E & 621 & A\\
\end{tabular}
\end{center}

\end{scriptsize}
\end{block}
\end{column}
\end{columns}
\end{frame}



\begin{frame}[fragile,label={sec:orgc14ae03}]{Tidy tools}
 \framesubtitle{Wickham (submitted)}

\begin{columns}
\begin{column}{.5\columnwidth}
\begin{block}{Tidy tools}
\begin{center}
\begin{tabular}{lll}
tidy data & \(\rightarrow\) & tidy data\\
\emph{input} &  & \emph{output}\\
\end{tabular}
\end{center}
\end{block}
\end{column}
\end{columns}

\begin{description}[transforming]
  \item[transform] create/modify variables, rearranging columns
  \item[filter] include/exclude observations (rows)
  \item[aggregate] collapse subsets of observations into single values
  \item[order] sort observations
\end{description}

Not all tools in base \texttt{R} are tidy. Wickham's package \texttt{dplyr} adds tidy
versions, plus additional functionality. Also, optimized for speed!
\end{frame}



\begin{frame}[fragile,label={sec:org1d34f4b}]{\texttt{dplyr} and the Wickham Six}
 According to R developer Hadley Wickham (@hadleywickham), 90\% of data
analysis can be reduced to the operations described by six English
verbs.

\begin{center}
\begin{tabular}{ll}
\texttt{select()} & Include or exclude certain variables (columns)\\
\texttt{filter()} & Include or exclude certain observations (rows)\\
\texttt{mutate()} & Create new variables (columns)\\
\texttt{arrange()} & Change the order of observations (rows)\\
\texttt{group\_by()} & Organize the observations into groups\\
\texttt{summarise()} & Derive aggregate variables for groups of observations\\
\end{tabular}
\end{center}

These functions reside in the add-on package \texttt{dplyr}.  See the data
wrangling cheat sheet!
\end{frame}

\begin{frame}[label={sec:org2695c8c}]{Boolean expressions}
\begin{small}

\begin{center}
\begin{tabular}{lll}
Operator & Name & is TRUE if and only if\\
\hline
A < B & less than & A is less than B\\
A <= B & less than or equal & A is less than or equal to B\\
A > B & greater than & A is greater than B\\
A >= B & greater than or equal & A is greater than or equal to B\\
A == B & equivalence & A exactly equals B\\
A != B & not equal & A does not exactly equal B\\
A \%in\% B & in & A is an element of vector B\\
\end{tabular}
\end{center}

\end{small}
\end{frame}
\end{document}
